In [ ]:
#1.
Q1. Create a DataFrame with the following student marks and display students with marks above 80.
{'Name': ['Anu', 'Raj', 'Diya', 'Kiran'], 'Marks': [76, 88, 95, 65]}

expected Output:
    
    Name  Marks
1   Raj     88
2  Diya     95

In [1]:
import pandas as pd

In [2]:
data = {'Name': ['Anu', 'Raj', 'Diya', 'Kiran'], 'Marks': [76, 88, 95, 65]}

In [4]:
df = pd.DataFrame(data)
df

    Name  Marks
0    Anu     76
1    Raj     88
2   Diya     95
3  Kiran     65

In [8]:
student_marks = df[df['Marks']>80]
student_marks

   Name  Marks
1   Raj     88
2  Diya     95

In [ ]:
#2.Q2. Create a DataFrame and find the mean salary grouped by department.
{'Name': ['Amit', 'Sneha', 'Kunal', 'Riya'], 'Department': ['HR', 'IT', 'HR', 'IT'], 'Salary': [30000, 50000, 35000, 52000]}
Expected Output:
Department
HR    32500.0
IT    51000.0
Name: Salary, dtype: float64

In [9]:
import pandas as pd

In [14]:
data_salary = {'Name': ['Amit', 'Sneha', 'Kunal', 'Riya'], 'Department': ['HR', 'IT', 'HR', 'IT'], 'Salary': [30000, 50000, 35000, 52000]}
df=pd.DataFrame(data)
df

    Name Department  Salary
0   Amit         HR   30000
1  Sneha         IT   50000
2  Kunal         HR   35000
3   Riya         IT   52000

In [17]:
mean_salary = df.groupby('Department')['Salary'].mean()
mean_salary

Department
HR    32500.0
IT    51000.0
Name: Salary, dtype: float64

In [ ]:
#3.Q3. Create a DataFrame and apply label encoding to the Gender column.
{'Name': ['Arjun', 'Leela', 'Kiran'], 'Gender': ['Male', 'Female', 'Male']}
Expected Output:
    Name  Gender  Gender_encoded
0  Arjun    Male               1
1  Leela  Female               0
2  Kiran    Male               1

In [18]:
import pandas as pd

In [19]:
data = {'Name': ['Arjun', 'Leela', 'Kiran'], 'Gender': ['Male', 'Female', 'Male']}

In [20]:
df = pd.DataFrame(data)
df

    Name  Gender
0  Arjun    Male
1  Leela  Female
2  Kiran    Male

In [26]:
from sklearn.preprocessing import LabelEncoder

# le = LabelEncoder()
# df['Gender'] = le.fit_transform(df['Gender'])
# df
le = LabelEncoder()
df['Gender_encoded'] = le.fit_transform(df['Gender'])
df

    Name  Gender  Gender_encoded
0  Arjun       1               1
1  Leela       0               0
2  Kiran       1               1

In [ ]:
#4.🔹Q4. Normalize the 'Score' column using Min-Max scaling.
{'Student': ['A', 'B', 'C'], 'Score': [55, 80, 65]}

Expected Output:
    Student  Score  Normalized_Score
0       A     55               0.0
1       B     80               1.0
2       C     65               0.4

In [27]:
import pandas as pd

In [29]:
data = {'Student': ['A', 'B', 'C'], 'Score': [55, 80, 65]}
df = pd.DataFrame(data)
df

  Student  Score
0       A     55
1       B     80
2       C     65

In [36]:
from sklearn.preprocessing import MinMaxScaler
min_max_scaler = MinMaxScaler()
df['Normalize_score'] = min_max_scaler.fit_transform(df[['Score']])
df

  Student  Score  Normalize_score
0       A     55              0.0
1       B     80              1.0
2       C     65              0.4

In [ ]:
#5.
Use SVM, RandomForest, and GaussianNB to classify customers as 'Buy' or 'Not Buy' based on Age and Salary.
{'Age': [22, 25, 47, 52, 46, 56, 23], 'Salary': [15000, 29000, 48000, 60000, 52000, 61000, 17000], 'Buy': [0, 0, 1, 1, 1, 1, 0]}

In [37]:
import pandas as pd

In [39]:
data = {'Age': [22, 25, 47, 52, 46, 56, 23], 'Salary': [15000, 29000, 48000, 60000, 52000, 61000, 17000], 'Buy': [0, 0, 1, 1, 1, 1, 0]}
df = pd.DataFrame(data)
df

   Age  Salary  Buy
0   22   15000    0
1   25   29000    0
2   47   48000    1
3   52   60000    1
4   46   52000    1
5   56   61000    1
6   23   17000    0

In [46]:
from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestClassifier
from sklearn.svm import SVC
from sklearn.metrics import accuracy_score

In [47]:
x = df.drop(columns=["Buy"])
y = df["Buy"]
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.2, random_state=42)

In [48]:
models = {
    "SVM" : SVC(),
    "Random Forest": RandomForestClassifier()
}
for name, model in models.items():
    model.fit(x_train, y_train)
    y_predict = model.predict(x_test)
    print(f"{name} {accuracy_score(y_test, y_predict): .2f}")

SVM  0.50
Random Forest  1.00